const channels = {

    Public: {
        tax: '1463690185870016512', // روم الضريبة التلقائية
        sugg: '', // روم الأقتراحات
        feedback: '1463690188633931817', // روم الاراء
        post: '1463690156795105392',// روم المنشورات المميزة
        gift: '',// روم اعلانات الهداية
        Warns: '1463690130245287956',// روم تحذيرات البائعين
        ads: '',// روم الاعلانات العادية
        adscategor: '1463689942860435641',// كاتيكوري الاعلانات
        FirstCat:'1463689893229232188',// اول كاتيكوري للاعلانات الي تكون اول شي
        privateSCategory: '1463689956743450695',// كاتيكوري الرومات الخاصة
        OpenCloseRoom: '1463690154110615583',
    },

    Orders: {
        tasmin: '1463724994780594177', // روم طلب التصميم
        program: '1463724950304198717', // روم طلب البرمجيات
        mntj: '1463724891143405649', // روم طلب المنتجات
    },

    Ticket: {
        SupportCategory: '1463689982614044776',// ايدي كاتيكوري تكتات الدعم الفني
        ReportCategory: '1463689982614044776',//ايدي كاتيكوري تكتات الشكاوي
    },
    
    Log: { // لوق بيع الرتب , المنشورات المميزة , الاعلانات , الرومات الخاصة
        RolesLog: '1463690352765571225',
        PostLog: '1463690365121855581',
        AdsLog: '1463690362232242369',
        PrivateSLog: '1463690358683603015',
        TicketLog: '1463690355818889341',
    },

    AutoLine: [ //رومات الخط التلقائي عدا رومات البيع
        '1463690110779265128',
        '1463690119625052373',
        '1463690127632236627',
        '1463690130245287956',
        '1463690224650686505',
        '1463690236902248562',
        '1463690248272875653',
        '1463690268023722090',
        '1463690271295406123',
        '1463690277909696694',
        '1463690136108666933',
        '1463690103653404685',
    ],

    ShopRooms: [ // ايدي رومات البيع
        '',
        '',
        '1463690159387054123',
        '1463690162419666954',
        '1463690166056128644',
        '1463690169264902235',
        '1463690172276150415',
        '1463690176252481602',
        '1463690179452866687',
    ],

};

module.exports = channels;