const roles = {

    sellerRole: '1463689829345792144',

    Public: {
        verifyrole:'1463689809024258235',
    },

    Admins: {
        DiscordStaff: '1463689753441599488',
        DiscordLeader: '1463689555164008458',
    },

    price: { //الاسعار بدون الضريبة
        'Momo S': '200000', //رتب بيع
        'Pro S': '105000', //رتب بيع
        'Apex S': '95000', //رتب بيع
        'Titan S': '85000', //رتب بيع
        'Vanguard S':'75000', //رتب بيع
        'Phoenix S': '65000', //رتب بيع
        'Tech Smith S': '55000', //رتب بيع
        'Programing': '45000', //رتب بيع
        'Designs': '35000', //رتب بيع

        'here': '250000', //منشور مميز
        'everyone': '300000', //منشور مميز

        'بدون منشن': '100000', //اعلان
        'منشن هير': '150000', //اعلان
        'منشن ايفري ون': '250000', //اعلان
        'بروم الهداية': '500000', //اعلان
        'روم خاص مع قيف اوي':'750000', //اعلان
        'اول روم':'1500000', //اعلان

        '7d': '250000', //روم خاص
        'renew7d': '75000',//سعر تجديد روم خاص
    },
    roleid: { // ايديات الرتب
        'Titan S': '1463689789407756462',
        'Vanguard S': '1463689797166960813',
        'Phoenix S': '1463689798890819821',
        'Tech Smith S': '1463689800048709752',
        'Programing': '1463689801353138348',
        'Designs': '1463689802875670720',
        'PrivateS': '',// روم خاص
    },

    WarnsRole: { //ايديات رتب التحذيرات
        Warn25: "1463689812132364321",
        Warn50: "1463689813445181714",
        Warn100: "1463689814925774898",
    },

    RolesSellers: [ //ايديات رتب البيع
        "1463689789407756462",
        "1463689797166960813",
        "1463689798890819821",
        "1463689800048709752",
        "1463689801353138348",
        "1463689802875670720",
        "",
        "",
        "",
        "",
        "",
        "",
    ]
}

module.exports = roles;